/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sort_dual_stack.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: woonshin <woonshin@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/02/07 14:56:15 by woonshin          #+#    #+#             */
/*   Updated: 2024/02/07 23:38:33 by woonshin         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

/*
1. tail의 값을 기억.
2. rotate하면서 tail의 값보다 큰 값들을 찾기아서 오른쪽으로 이동
3. 다시 a로 가져오기
*/

int sort_dual_stack(t_dual_stack *dual_stack)
{
    return (0);
}